In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('./train.csv')

In [3]:
data.head()

,TRIP_ID,CALL_TYPE,ORIGIN_CALL,ORIGIN_STAND,TAXI_ID,TIMESTAMP,DAY_TYPE,MISSING_DATA,POLYLINE
0,1372636858620000589,C,NaN,NaN,20000589,1372636858,A,False,"[[-8.618643,41.141412],[-8.618499,41.141376],[..."
1,1372637303620000596,B,NaN,7.0,20000596,1372637303,A,False,"[[-8.639847,41.159826],[-8.640351,41.159871],[..."
2,1372636951620000320,C,NaN,NaN,20000320,1372636951,A,False,"[[-8.612964,41.140359],[-8.613378,41.14035],[-..."
3,1372636854620000520,C,NaN,NaN,20000520,1372636854,A,False,"[[-8.574678,41.151951],[-8.574705,41.151942],[..."
4,1372637091620000337,C,NaN,NaN,20000337,1372637091,A,False,"[[-8.645994,41.18049],[-8.645949,41.180517],[-..."

In [6]:
for i in data.columns:
    print(data[[i]].isnull().sum())

TRIP_ID    0
dtype: int64
CALL_TYPE    0
dtype: int64
ORIGIN_CALL    1345900
dtype: int64
ORIGIN_STAND    904091
dtype: int64
TAXI_ID    0
dtype: int64
TIMESTAMP    0
dtype: int64
DAY_TYPE    0
dtype: int64
MISSING_DATA    0
dtype: int64
POLYLINE    0
dtype: int64

In [15]:
data['date_time'] = pd.to_datetime(data['TIMESTAMP'], unit='s')

In [29]:
data['second'] = pd.DatetimeIndex(data['date_time']).second

In [30]:
data.head()

,TRIP_ID,CALL_TYPE,ORIGIN_CALL,ORIGIN_STAND,TAXI_ID,TIMESTAMP,DAY_TYPE,MISSING_DATA,POLYLINE,date_time,year,month,day,hour,minute,second
0,1372636858620000589,C,NaN,NaN,20000589,1372636858,A,False,"[[-8.618643,41.141412],[-8.618499,41.141376],[...",2013-07-01 00:00:58,2013,7,1,0,0,58
1,1372637303620000596,B,NaN,7.0,20000596,1372637303,A,False,"[[-8.639847,41.159826],[-8.640351,41.159871],[...",2013-07-01 00:08:23,2013,7,1,0,8,23
2,1372636951620000320,C,NaN,NaN,20000320,1372636951,A,False,"[[-8.612964,41.140359],[-8.613378,41.14035],[-...",2013-07-01 00:02:31,2013,7,1,0,2,31
3,1372636854620000520,C,NaN,NaN,20000520,1372636854,A,False,"[[-8.574678,41.151951],[-8.574705,41.151942],[...",2013-07-01 00:00:54,2013,7,1,0,0,54
4,1372637091620000337,C,NaN,NaN,20000337,1372637091,A,False,"[[-8.645994,41.18049],[-8.645949,41.180517],[-...",2013-07-01 00:04:51,2013,7,1,0,4,51

In [11]:
data[['ORIGIN_STAND']].isnull().sum()

ORIGIN_STAND    904091
dtype: int64

In [13]:
loc = pd.read_csv('./metaData_taxistandsID_name_GPSlocation.csv')

In [31]:
meta_df = pd.read_csv('metaData_taxistandsID_name_GPSlocation.csv')

In [34]:
import numpy as np

In [37]:
data['ORIGIN_STAND'] = data['ORIGIN_STAND'].replace(np.array(meta_df['ID']),np.array(meta_df['Descricao']))

In [36]:
meta_df

    ID                 Descricao       Latitude  Longitude
0    1                      Agra  41.1771457135  -8.609670
1    2                   Alameda    41.15618964  -8.591064
2    3                    Aldoar  41.1705249231  -8.665876
3    4                 Alfândega  41.1437639911  -8.621803
4    5                     Amial  41.1835097223  -8.612726
..  ..                       ...            ...        ...
58  59           Tenente Valadim  41.1607030178  -8.641205
59  60                  Trindade  41.1511237005  -8.609843
60  61  Vinte e Quatro de Agosto  41.1493101131  -8.600309
61  62                      Viso  41.1778737602  -8.646558
62  63               Santa Maria  41.1603753216  -8.609370

[63 rows x 4 columns]

In [38]:
data['ORIGIN_STAND']

0                   NaN
1          Av. Boavista
2                   NaN
3                   NaN
4                   NaN
               ...
1710665             NaN
1710666             NaN
1710667             NaN
1710668     Bom Sucesso
1710669         Infante
Name: ORIGIN_STAND, Length: 1710670, dtype: object